Revit 2027 API
SymbolTypeId.KBtu Property
 Symbol kBtu, indicating unit Thousand British thermal units.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId KBtu { get; }
Public Shared ReadOnly Property KBtu As ForgeTypeId
	Get
public:
static property ForgeTypeId^ KBtu {
	ForgeTypeId^ get ();
}
static member KBtu : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SymbolTypeId Class
Autodesk.Revit.DB Namespace